Car_dealershipBen/app/controllers/cars_controller.rb

  def search
    @results = []
    @search_term = params[:search_input]
    Car.all.each do |car|
---
SELECT "cars".* FROM "cars"